## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_resource_group.app will be updated in-place
  ~ resource "azurerm_resource_group" "app" {
        id         = "/subscriptions/5eb83737-e0c8-46c1-818d-4d9725820e3f/resourceGroups/jose0337-a12-rg"
        name       = "jose0337-a12-rg"
      ~ tags       = {
          - "Environment" = "Test" -> null
          - "Purpose"     = "DriftDetection" -> null
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_subnet.app will be created
  + resource "azurerm_subnet" "app" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "jose0337-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "jose0337-a12-rg"
      + virtual_network_name                           = "jose0337-vnet"
    }

  # azurerm_virtual_network.app will be created
  + resource "azurerm_virtual_network" "app" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "canadacentral"
      + name                = "jose0337-vnet"
      + resource_group_name = "jose0337-a12-rg"
      + subnet              = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>